12/data/attachments/51a58992ac0b0148.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Caitlin_upon_Friend_80115_2</nif:username>
            <nif:friendToBeRequested>soap_friends_d6253725-c8f0-43f9-8a64-f1a2ba3950fa</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>